WSCKY/STM32F401RE_Nucleo_Demo/MyProj/Ext_MPU6050/inc/stm32f4xx_nucleo_ExtMPU6050.h
/**
  ******************************************************************************
  * @file    stm32f4xx_nucleo_ExtMPU6050.h
  * @author  '^_^'
  * @version V0.0.0
  * @date    10-October-2014
  * @brief   Header file for stm32f4xx_nucleo_ExtMPU6050.c
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32F4XX_NUCLEO_EXTMPU6050_H
#define __STM32F4XX_NUCLEO_EXTMPU6050_H

#include "stm32f4xx_hal.h"

typedef enum
{
	FALSE = 0,
	TRUE = !FALSE
}bool;

/**
  * @brief  MPU6050 Struct
  */
typedef struct
{
	uint8_t Sleep_Mode;
	uint8_t Clock_Mode;
	uint8_t Wake_FREQ;
	uint8_t STDBY_Mode;
	uint8_t Gyro_FullScale;
	uint8_t Acce_FullScale;
	uint8_t HighPassFilter;
	uint8_t LowPassFilter;
	uint8_t EXT_SYNC;
	uint8_t SMPLRT_DIV;
}MPU6050_InitTypeDef;

/**
  * @brief  MPU6050 INT Struct
  */
typedef struct
{
	uint8_t INT_LEVEL;
	uint8_t INT_OPEN;
	uint8_t LATCH_INT_EN;
	uint8_t INT_RD_CLEAR;
	uint8_t DATA_RDY_EN;
}MPU6050_INTTypeDef;

typedef struct
{
	int16_t AcceX;
	int16_t AcceY;
	int16_t AcceZ;
}AcceDef;

typedef struct
{
	int16_t GyroX;
	int16_t GyroY;
	int16_t GyroZ;
}GyroDef;

/**
  * @brief  MPU6050 I2C Interface pins
  */
#define MPU6050_I2C_SDA_PIN					GPIO_PIN_8					/* PB.08 */
#define MPU6050_I2C_SDA_GPIO_PORT			GPIOB						/* GPIOB */
#define MPU6050_I2C_SDA_GPIO_CLK_ENABLE()	__GPIOB_CLK_ENABLE()
#define MPU6050_I2C_SDA_GPIO_CLK_DISABLE()	__GPIOB_CLK_DISABLE()

#define MPU6050_I2C_SCL_PIN					GPIO_PIN_9					/* PB.09 */
#define MPU6050_I2C_SCL_GPIO_PORT			GPIOB						/* GPIOB */
#define MPU6050_I2C_SCL_GPIO_CLK_ENABLE()	__GPIOB_CLK_ENABLE()
#define MPU6050_I2C_SCL_GPIO_CLK_DISABLE()	__GPIOB_CLK_DISABLE()

#define CorCount							200
#define MPU6050_ADDR						0xD0
#define DELAY_TIME							20

/******************************************************************************/
/*************************** START REGISTER MAPPING  **************************/
/******************************************************************************/

/**
  *The register map for the MPU-60X0 is listed below.
  */

/**
  *Note: Register Names ending in _H and _L contain the high and low bytes, respectively,
  *of an internal register value.
  *In the detailed register tables that follow, register names are in capital letters,
  *while register values are in capital letters and italicized. For example, the ACCEL_XOUT_H
  *register (Register 59) contains the 8 most significant bits, ACCEL_XOUT[15:8], of the 16-bit
  *X-Axis accelerometer measurement, ACCEL_XOUT.
  *The reset value is 0x00 for all registers other than the registers below :
  *		Register 107: 0x40.
  *		Register 117: 0x68.
  */
#define MPU6050_RA_XG_OFFS_TC				0x00 //[7] PWR_MODE, [6:1] XG_OFFS_TC, [0] OTP_BNK_VLD
#define MPU6050_RA_YG_OFFS_TC				0x01 //[7] PWR_MODE, [6:1] YG_OFFS_TC, [0] OTP_BNK_VLD
#define MPU6050_RA_ZG_OFFS_TC				0x02 //[7] PWR_MODE, [6:1] ZG_OFFS_TC, [0] OTP_BNK_VLD
#define MPU6050_RA_X_FINE_GAIN				0x03 //[7:0] X_FINE_GAIN
#define MPU6050_RA_Y_FINE_GAIN				0x04 //[7:0] Y_FINE_GAIN
#define MPU6050_RA_Z_FINE_GAIN				0x05 //[7:0] Z_FINE_GAIN
#define MPU6050_RA_XA_OFFS_H				0x06 //[15:0] XA_OFFS
#define MPU6050_RA_XA_OFFS_L_TC				0x07
#define MPU6050_RA_YA_OFFS_H				0x08 //[15:0] YA_OFFS
#define MPU6050_RA_YA_OFFS_L_TC				0x09
#define MPU6050_RA_ZA_OFFS_H				0x0A //[15:0] ZA_OFFS
#define MPU6050_RA_ZA_OFFS_L_TC				0x0B
#define MPU6050_RA_XG_OFFS_USRH				0x13 //[15:0] XG_OFFS_USR
#define MPU6050_RA_XG_OFFS_USRL				0x14
#define MPU6050_RA_YG_OFFS_USRH				0x15 //[15:0] YG_OFFS_USR
#define MPU6050_RA_YG_OFFS_USRL				0x16
#define MPU6050_RA_ZG_OFFS_USRH				0x17 //[15:0] ZG_OFFS_USR
#define MPU6050_RA_ZG_OFFS_USRL				0x18

/************************************************************************************************
*Register 25(R19h) 每 Sample Rate Divider
*Type: Read/Write
*+--------------+------------------+------+------+------+------+------+------+------+------+
*|Register (Hex)|Register (Decimal)| Bit7 | Bit6 | Bit5 | Bit4 | Bit3 | Bit2 | Bit1 | Bit0 |
*+--------------+------------------+------+------+------+------+------+------+------+------+
*|		1A	    |        26        |					SMPLRT_DIV[7:0]					   |
*+--------------+------------------+-------------------------------------------------------+
*Description:
*	This register specifies the divider from the gyroscope output rate used to generate the Sample Rate for the MPU-60X0.
*	The sensor register output, FIFO output, DMP sampling, Motion detection, Zero Motion detection, and Free Fall detection are all based on the Sample Rate.
*	The Sample Rate is generated by dividing the gyroscope output rate by SMPLRT_DIV:
*	Sample Rate = Gyroscope Output Rate / (1 + SMPLRT_DIV)
*	where Gyroscope Output Rate = 8kHz when the DLPF is disabled (DLPF_CFG = 0 or 7), and 1kHz when the DLPF is enabled (see Register 26).
*Note: The accelerometer output rate is 1kHz. This means that for a Sample Rate greater than 1kHz, the same accelerometer sample may be output to the FIFO, DMP, and sensor registers more than once.
*	For a diagram of the gyroscope and accelerometer signal paths, see Section 8 of the MPU-6000/MPU-6050 Product Specification document.
*Parameters:
*	SMPLRT_DIV	8-bit unsigned value. The Sample Rate is determined by dividing the gyroscope output rate by this value.
************************************************************************************************/
#define MPU6050_RA_SMPLRT_DIV				0x19
/************************************************************************************************
*Register 26(R1Ah) 每 Configuration
*Type: Read/Write
*+--------------+------------------+------+------+------+------+------+------+------+------+
*|Register (Hex)|Register (Decimal)| Bit7 | Bit6 | Bit5 | Bit4 | Bit3 | Bit2 | Bit1 | Bit0 |
*+--------------+------------------+------+------+------+------+------+------+------+------+
*|		1A	    |        26        |   -  |   -  |  EXT_SYNC_SET[2:0] |    DLPF_CFG[2:0]   |
*+--------------+------------------+------+------+--------------------+--------------------+
*Description:
*	This register configures the external Frame Synchronization (FSYNC) pin sampling and the Digital Low Pass Filter (DLPF) setting for both the gyroscopes and accelerometers.
*	An external signal connected to the FSYNC pin can be sampled by configuring EXT_SYNC_SET.
*	Signal changes to the FSYNC pin are latched so that short strobes may be captured. The latched FSYNC signal will be sampled at the Sampling Rate, as defined in register 25. After sampling, the latch will reset to the current FSYNC signal state.
*	The sampled value will be reported in place of the least significant bit in a sensor data register determined by the value of EXT_SYNC_SET according to the following table.
*	EXT_SYNC_SET-----FSYNC Bit Location
*	      0            Input disabled
*	      1            TEMP_OUT_L[0]
*	      2            GYRO_XOUT_L[0]
*	      3            GYRO_YOUT_L[0]
*	      4            GYRO_ZOUT_L[0]
*	      5            ACCEL_XOUT_L[0]
*	      6            ACCEL_YOUT_L[0]
*	      7            ACCEL_ZOUT_L[0]
*	The DLPF is configured by DLPF_CFG. The accelerometer and gyroscope are filtered according to the value of DLPF_CFG as shown in the table below.
*	+--------+-------------------------+----------------------------------+
*	|DLPF_CFG|Accelerometer (Fs = 1kHz)|			  Gyroscope			  |
*	+--------+--------------+----------+--------------+----------+--------+
*	|        |Bandwidth (Hz)|Delay (ms)|Bandwidth (Hz)|Delay (ms)|Fs (kHz)|
*	+--------+--------------+----------+--------------+----------+--------+
*	|	0	 |		260		|	 0     |	 256 	  |   0.98   |	  8   |
*	+--------+--------------+----------+--------------+----------+--------+
*	|	1	 |		184		|	 2.0   |	 188 	  |    1.9   |	  1   |
*	+--------+--------------+----------+--------------+----------+--------+
*	|	2	 |		94		|	 3.0   |	  98 	  |    2.8   |	  1   |
*	+--------+--------------+----------+--------------+----------+--------+
*	|	3	 |		44		|	 4.9   |	  42 	  |    4.8   |	  1   |
*	+--------+--------------+----------+--------------+----------+--------+
*	|	4	 |		21		|	 8.5   |	  20 	  |    8.3   |	  1   |
*	+--------+--------------+----------+--------------+----------+--------+
*	|	5	 |		10		|	 13.8  |	  10 	  |    13.4  |	  1   |
*	+--------+--------------+----------+--------------+----------+--------+
*	|	6	 |		5		|	 19.0  |	  5 	  |    18.6  |	  1   |
*	+--------+--------------+----------+--------------+----------+--------+
*	|	7	 |			Reserved	   |		  Reserved		 |	  8   |
*	+--------+-------------------------+-------------------------+--------+
*	Bit 7 and bit 6 are reserved.
*Parameters:
*	EXT_SYNC_SET 3-bit unsigned value. Configures the FSYNC pin sampling.
*	DLPF_CFG 3-bit unsigned value. Configures the DLPF setting.
************************************************************************************************/
#define MPU6050_RA_CONFIG					0x1A
/************************************************************************************************
*Register 27(R1Bh) 每 Gyroscope Configuration
*Type: Read/Write
*+--------------+------------------+------+------+------+------+------+------+------+------+
*|Register (Hex)|Register (Decimal)| Bit7 | Bit6 | Bit5 | Bit4 | Bit3 | Bit2 | Bit1 | Bit0 |
*+--------------+------------------+------+------+------+------+------+------+------+------+
*|		1B	    |        27        | XG_ST| YG_ST| ZG_ST| FS_SEL[1:0] |   -  |	-   |   -  |
*+--------------+------------------+------+------+------+-------------+------+------+------+
*Description:
*	This register is used to trigger gyroscope self-test and configure the gyroscopes＊ full scale range.
*	Gyroscope self-test permits users to test the mechanical and electrical portions of the gyroscope. The self-test for each gyroscope axis can be activated by controlling the XG_ST, YG_ST, and ZG_ST bits of this register. Self-test for each axis may be performed independently or all at the same time.
*	When self-test is activated, the on-board electronics will actuate the appropriate sensor. This actuation will move the sensor＊s proof masses over a distance equivalent to a pre-defined Coriolis force. This proof mass displacement results in a change in the sensor output, which is reflected in the output signal. The output signal is used to observe the self-test response.
*	The self-test response is defined as follows:
*	Self-test response = Sensor output with self-test enabled 每 Sensor output without self-test enabled
*	The self-test limits for each gyroscope axis is provided in the electrical characteristics tables of the MPU-6000/MPU-6050 Product Specification document. When the value of the self-test response is within the min/max limits of the product specification, the part has passed self test. When the self-test response exceeds the min/max values specified in the document, the part is deemed to have failed self-test.
*	FS_SEL selects the full scale range of the gyroscope outputs according to the following table.
*	FS_SEL-----Full Scale Range
*	  0			   ㊣ 250 ～/s
*	  1			   ㊣ 500 ～/s
*	  2			  ㊣ 1000 ～/s
*	  3			  ㊣ 2000 ～/s
*	Bits 2 through 0 are reserved.
*Parameters:
*	XG_ST	Setting this bit causes the X axis gyroscope to perform self test.
*	YG_ST	Setting this bit causes the Y axis gyroscope to perform self test.
*	ZG_ST	Setting this bit causes the Z axis gyroscope to perform self test.
*	FS_SEL	2-bit unsigned value. Selects the full scale range of gyroscopes.
************************************************************************************************/
#define MPU6050_RA_GYRO_CONFIG				0x1B
/************************************************************************************************
*Register 28(R1Ch) 每 Accelerometer Configuration
*Type: Read/Write
*+--------------+------------------+------+------+------+------+------+------+------+------+
*|Register (Hex)|Register (Decimal)| Bit7 | Bit6 | Bit5 | Bit4 | Bit3 | Bit2 | Bit1 | Bit0 |
*+--------------+------------------+------+------+------+------+------+------+------+------+
*|		1C	    |        28        | XA_ST| YA_ST| ZA_ST| AFS_SEL[1:0]|   ACCEL_HPF[2:0]   |
*+--------------+------------------+------+------+------+-------------+--------------------+
*Description:
*	This register is used to trigger accelerometer self test and configure the accelerometer full scale range. This register also configures the Digital High Pass Filter (DHPF).
*	Accelerometer self-test permits users to test the mechanical and electrical portions of the accelerometer. The self-test for each accelerometer axis can be activated by controlling the XA_ST, YA_ST, and ZA_ST bits of this register. Self-test for each axis may be performed independently or all at the same time.
*	When self-test is activated, the on-board electronics will actuate the appropriate sensor. This actuation simulates an external force. The actuated sensor, in turn, will produce a corresponding output signal. The output signal is used to observe the self-test response.
*	The self-test response is defined as follows:
*	Self-test response = Sensor output with self-test enabled - Sensor output without self-test enabled
*	The self-test limits for each accelerometer axis is provided in the electrical characteristics tables of the MPU-6000/MPU-6050 Product Specification document. When the value of the self-test response is within the min/max limits of the product specification, the part has passed self test. When the self-test response exceeds the min/max values specified in the document, the part is deemed to have failed self-test.
*	AFS_SEL	selects the full scale range of the accelerometer outputs according to the following table.
*	AFS_SEL-----Full Scale Range
*	   0			  ㊣2g
*	   1			  ㊣4g
*	   2			  ㊣8g
*	   3			  ㊣16g
*	ACCEL_HPF	configures the DHPF available in the path leading to motion detectors (Free Fall, Motion threshold, and Zero Motion). The high pass filter output is not available to the data registers (see Figure in Section 8 of the MPU-6000/MPU-6050 Product Specification document).
*	The high pass filter has three modes:
*	Reset: The filter output settles to zero within one sample. This effectively disables the high pass filter. This mode may be toggled to quickly settle the filter.
*	On: The high pass filter will pass signals above the cut off frequency.
*	Hold: When triggered, the filter holds the present sample. The filter output will be the difference between the input sample and the held sample.
*	ACCEL_HPF-----Filter Mode-----Cut-off Frequency
*		0			Reset				 None
*		1			 On					 5Hz
*		2			 On					 2.5Hz
*		3			 On					 1.25Hz
*		4			 On					 0.63Hz
*		7			Hold				 None
*Parameters:
*	XA_ST			When set to 1, the X- Axis accelerometer performs self test.
*	YA_ST			When set to 1, the Y- Axis accelerometer performs self test.
*	ZA_ST			When set to 1, the Z- Axis accelerometer performs self test.
*	ACCEL_FS_SEL	2-bit unsigned value. Selects the full scale range of accelerometers.
*	ACCEL_HPF		3-bit unsigned value. Selects the Digital High Pass Filter configuration.
************************************************************************************************/
#define MPU6050_RA_ACCEL_CONFIG				0x1C

#define MPU6050_RA_FF_THR					0x1D
#define MPU6050_RA_FF_DUR					0x1E
#define MPU6050_RA_MOT_THR					0x1F
#define MPU6050_RA_MOT_DUR					0x20
#define MPU6050_RA_ZRMOT_THR				0x21
#define MPU6050_RA_ZRMOT_DUR				0x22
#define MPU6050_RA_FIFO_EN					0x23
#define MPU6050_RA_I2C_MST_CTRL				0x24
#define MPU6050_RA_I2C_SLV0_ADDR			0x25
#define MPU6050_RA_I2C_SLV0_REG				0x26
#define MPU6050_RA_I2C_SLV0_CTRL			0x27
#define MPU6050_RA_I2C_SLV1_ADDR			0x28
#define MPU6050_RA_I2C_SLV1_REG				0x29
#define MPU6050_RA_I2C_SLV1_CTRL			0x2A
#define MPU6050_RA_I2C_SLV2_ADDR			0x2B
#define MPU6050_RA_I2C_SLV2_REG				0x2C
#define MPU6050_RA_I2C_SLV2_CTRL			0x2D
#define MPU6050_RA_I2C_SLV3_ADDR			0x2E
#define MPU6050_RA_I2C_SLV3_REG				0x2F
#define MPU6050_RA_I2C_SLV3_CTRL			0x30
#define MPU6050_RA_I2C_SLV4_ADDR			0x31
#define MPU6050_RA_I2C_SLV4_REG				0x32
#define MPU6050_RA_I2C_SLV4_DO				0x33
#define MPU6050_RA_I2C_SLV4_CTRL			0x34
#define MPU6050_RA_I2C_SLV4_DI				0x35
#define MPU6050_RA_I2C_MST_STATUS			0x36
/************************************************************************************************
*Register 55(R37h) 每 INT Pin / Bypass Enable Configuration
*Type: Read/Write
*+--------------+------------------+---------+--------+------------+------------+---------------+------------+-------------+---------+
*|Register (Hex)|Register (Decimal)|   Bit7  |  Bit6  |    Bit5    |    Bit4    |      Bit3     |    Bit2    |     Bit1    |   Bit0  |
*+--------------+------------------+---------+--------+------------+------------+---------------+------------+-------------+---------+
*|		1C	    |        28        |INT_LEVEL|INT_OPEN|LATCH_INT_EN|INT_RD_CLEAR|FSYNC_INT_LEVEL|FSYNC_INT_EN|I2C_BYPASS_EN|CLKOUT_EN|
*+--------------+------------------+---------+--------+------------+------------+---------------+------------+-------------+---------+
*Description:
*	This register configures the behavior of the interrupt signals at the INT pins. This register is also used to enable the FSYNC Pin to be used as an interrupt to the host application processor, as well as to enable Bypass Mode on the I2C Master. This bit also enables the clock output.
*	FSYNC_INT_EN enables the FSYNC pin to be used as an interrupt to the host application processor. A transition to the active level specified in FSYNC_INT_LEVEL will trigger an interrupt. The status of this interrupt is read from the PASS_THROUGH bit in the I2C Master Status Register (Register 54).
*	When I2C_BYPASS_EN is equal to 1 and I2C_MST_EN (Register 106 bit[5]) is equal to 0, the host application processor will be able to directly access the auxiliary I2C bus of the MPU-60X0. When this bit is equal to 0, the host application processor will not be able to directly access the auxiliary I2C bus of the MPU-60X0 regardless of the state of I2C_MST_EN.
*	For further information regarding Bypass Mode, please refer to Section 7.11 and 7.13 of the MPU-6000/MPU-6050 Product Specification document.
*Parameters:
*	INT_LEVEL		When this bit is equal to 0, the logic level for the INT pin is active high.
*					When this bit is equal to 1, the logic level for the INT pin is active low.
*	INT_OPEN		When this bit is equal to 0, the INT pin is configured as push-pull.
*					When this bit is equal to 1, the INT pin is configured as open drain.
*	LATCH_INT_EN	When this bit is equal to 0, the INT pin emits a 50us long pulse.
*					When this bit is equal to 1, the INT pin is held high until the interrupt is cleared.
*	INT_RD_CLEAR	When this bit is equal to 0, interrupt status bits are cleared only by reading INT_STATUS (Register 58)
*					When this bit is equal to 1, interrupt status bits are cleared on any read operation.
*	FSYNC_INT_LEVEL	When this bit is equal to 0, the logic level for the FSYNC pin (when used as an interrupt to the host processor) is active high.
*					When this bit is equal to 1, the logic level for the FSYNC pin (when used as an interrupt to the host processor) is active low.
*	FSYNC_INT_EN	When equal to 0, this bit disables the FSYNC pin from causing an interrupt to the host processor.
*					When equal to 1, this bit enables the FSYNC pin to be used as an interrupt to the host processor.
*	I2C_BYPASS_EN	When this bit is equal to 1 and I2C_MST_EN (Register 106 bit[5]) is equal to 0, the host application processor will be able to directly access the auxiliary I2C bus of the MPU-60X0.
*					When this bit is equal to 0, the host application processor will not be able to directly access the auxiliary I2C bus of the MPU-60X0 regardless of the state of I2C_MST_EN (Register 106 bit[5]).
*	CLKOUT_EN		When this bit is equal to 1, a reference clock output is provided at the CLKOUT pin.
*					When this bit is equal to 0, the clock output is disabled.
*					For further information regarding CLKOUT, please refer to the MPU-60X0 Product Specification document.
************************************************************************************************/
#define MPU6050_RA_INT_PIN_CFG				0x37
/************************************************************************************************
*Register 56(R38h) 每 Interrupt Enable
*Type: Read/Write
*+--------------+------------------+------+------+-------+-------------+--------------+------+------+------------+
*|Register (Hex)|Register (Decimal)| Bit7 | Bit6 |  Bit5 |     Bit4    |     Bit3     | Bit2 | Bit1 |    Bit0    |
*+--------------+------------------+------+------+-------+-------------+--------------+------+------+------------+
*|		38	    |        56        | FF_EN|MOT_EN|ZMOT_EN|FIFO_OFLOW_EN|I2C_MST_INT_EN|   -  |   -  |DATA _RDY_EN|
*+--------------+------------------+------+------+-------+-------------+--------------+------+------+------------+
*Description:
*	This register enables interrupt generation by interrupt sources.
*	For information regarding Free Fall detection, Motion detection, and Zero Motion detection, please refer to Registers 29 to 34
*	For information regarding the interrupt status for of each interrupt generation source, please refer to Register 58. Further information regarding I2C Master interrupt generation can be found in Register 54.
*	Bits 2 and 1 are reserved.
*Parameters:
*	FF_EN			When set to 1, this bit enables Free Fall detection to generate an interrupt.
*	MOT_EN			When set to 1, this bit enables Motion detection to generate an interrupt.
*	ZMOT_EN			When set to 1, this bit enables Zero Motion detection to generate an interrupt.
*	FIFO_OFLOW_EN	When set to 1, this bit enables a FIFO buffer overflow to generate an interrupt.
*	I2C_MST_INT_EN	When set to 1, this bit enables any of the I2C Master interrupt sources to generate an interrupt.
*	DATA_RDY_EN		When set to 1, this bit enables the Data Ready interrupt, which occurs each time a write operation to all of the sensor registers has been completed.
************************************************************************************************/
#define MPU6050_RA_INT_ENABLE				0x38

