WSCKY/STM32F401RE_Nucleo_Demo/MyProj/Ext_MPU6050/inc/stm32f4xx_nucleo_ExtMPU6050.h
#define MPU6050_RA_DMP_INT_STATUS			0x39
#define MPU6050_RA_INT_STATUS				0x3A
/************************************************************************************************
*Registers 59 to 64(R3Bh - R40h) 每 Accelerometer Measurements
*Type: Read Only
*Description:
*	These registers store the most recent accelerometer measurements.
*	Accelerometer measurements are written to these registers at the Sample Rate as defined in Register 25.
*	The accelerometer measurement registers, along with the temperature measurement registers, gyroscope measurement registers, and external sensor data registers, are composed of two sets of registers: an internal register set and a user-facing read register set.
*	The data within the accelerometer sensors＊ internal register set is always updated at the Sample Rate. Meanwhile, the user-facing read register set duplicates the internal register set＊s data values whenever the serial interface is idle. This guarantees that a burst read of sensor registers will read measurements from the same sampling instant. Note that if burst reads are not used, the user is responsible for ensuring a set of single byte reads correspond to a single sampling instant by checking the Data Ready interrupt.
*	Each 16-bit accelerometer measurement has a full scale defined in ACCEL_FS (Register 28). For each full scale setting, the accelerometers＊ sensitivity per LSB in ACCEL_xOUT is shown in the table below.
*	AFS_SEL-----Full Scale Range-----LSB Sensitivity
*		0			  ㊣2g              16384 LSB/mg 
*		1			  ㊣4g			    8192 LSB/mg
*		2			  ㊣8g				4096 LSB/mg  
*		3			  ㊣16g				2048 LSB/mg  
*Parameters:
*	ACCEL_XOUT	16-bit 2＊s complement value.
*				Stores the most recent X axis accelerometer measurement.
*	ACCEL_YOUT	16-bit 2＊s complement value.
*				Stores the most recent Y axis accelerometer measurement.
*	ACCEL_ZOUT	16-bit 2＊s complement value.
*				Stores the most recent Z axis accelerometer measurement.
************************************************************************************************/
#define MPU6050_RA_ACCEL_XOUT_H				0x3B
#define MPU6050_RA_ACCEL_XOUT_L				0x3C
#define MPU6050_RA_ACCEL_YOUT_H				0x3D
#define MPU6050_RA_ACCEL_YOUT_L				0x3E
#define MPU6050_RA_ACCEL_ZOUT_H				0x3F
#define MPU6050_RA_ACCEL_ZOUT_L				0x40
/************************************************************************************************
*Registers 65 and 66(R41h,R42h) 每 Temperature Measurement
*Type: Read Only
*Description:
*	These registers store the most recent temperature sensor measurement.
*	Temperature measurements are written to these registers at the Sample Rate as defined in Register 25.
*	These temperature measurement registers, along with the accelerometer measurement registers, gyroscope measurement registers, and external sensor data registers, are composed of two sets of registers: an internal register set and a user-facing read register set.
*	The data within the temperature sensor＊s internal register set is always updated at the Sample Rate. Meanwhile, the user-facing read register set duplicates the internal register set＊s data values whenever the serial interface is idle. This guarantees that a burst read of sensor registers will read measurements from the same sampling instant. Note that if burst reads are not used, the user is responsible for ensuring a set of single byte reads correspond to a single sampling instant by checking the Data Ready interrupt.
*	The scale factor and offset for the temperature sensor are found in the Electrical Specifications table (Section 6.4 of the MPU-6000/MPU-6050 Product Specification document).
*Parameters:
*	TEMP_OUT	16-bit signed value.
*				Stores the most recent temperature sensor measurement.
************************************************************************************************/
#define MPU6050_RA_TEMP_OUT_H				0x41
#define MPU6050_RA_TEMP_OUT_L				0x42
/************************************************************************************************
*Registers 67 to 72(R43h - R48h) 每 Gyroscope Measurements
*Type: Read Only
*Description:
*	These registers store the most recent gyroscope measurements.
*	Gyroscope measurements are written to these registers at the Sample Rate as defined in Register 25.
*	These gyroscope measurement registers, along with the accelerometer measurement registers, temperature measurement registers, and external sensor data registers, are composed of two sets of registers: an internal register set and a user-facing read register set.
*	The data within the gyroscope sensors＊ internal register set is always updated at the Sample Rate. Meanwhile, the user-facing read register set duplicates the internal register set＊s data values whenever the serial interface is idle. This guarantees that a burst read of sensor registers will read measurements from the same sampling instant. Note that if burst reads are not used, the user is responsible for ensuring a set of single byte reads correspond to a single sampling instant by checking the Data Ready interrupt.
*	Each 16-bit gyroscope measurement has a full scale defined in FS_SEL (Register 27). For each full scale setting, the gyroscopes＊ sensitivity per LSB in GYRO_xOUT is shown in the table below:
*	FS_SEL-----Full Scale Range-----LSB Sensitivity
*     0	  		㊣ 250 ～/s	   	   	  131 LSB/～/s
*	  1			㊣ 500 ～/s   		 65.5 LSB/～/s  
*	  2		   ㊣ 1000 ～/s  	         32.8 LSB/～/s
*	  3		   ㊣ 2000 ～/s            16.4 LSB/～/s 
*Parameters:
*	GYRO_XOUT	16-bit 2＊s complement value.
*				Stores the most recent X axis gyroscope measurement.
*	GYRO_YOUT	16-bit 2＊s complement value.
*				Stores the most recent Y axis gyroscope measurement.
*	GYRO_ZOUT	16-bit 2＊s complement value.
*				Stores the most recent Z axis gyroscope measurement.
************************************************************************************************/
#define MPU6050_RA_GYRO_XOUT_H				0x43
#define MPU6050_RA_GYRO_XOUT_L				0x44
#define MPU6050_RA_GYRO_YOUT_H				0x45
#define MPU6050_RA_GYRO_YOUT_L				0x46
#define MPU6050_RA_GYRO_ZOUT_H				0x47
#define MPU6050_RA_GYRO_ZOUT_L				0x48
/************************************************************************************************
*Registers 73 to 96(R49h - R60h) 每 External Sensor Data
*Type: Read Only
*Description:
*	These registers store data read from external sensors by the Slave 0, 1, 2, and 3 on the auxiliary I2C interface. Data read by Slave 4 is stored in I2C_SLV4_DI (Register 53).
*	External sensor data is written to these registers at the Sample Rate as defined in Register 25. This access rate can be reduced by using the Slave Delay Enable registers (Register 103).
*	External sensor data registers, along with the gyroscope measurement registers, accelerometer measurement registers, and temperature measurement registers, are composed of two sets of registers: an internal register set and a user-facing read register set.
*	The data within the external sensors＊ internal register set is always updated at the Sample Rate (or the reduced access rate) whenever the serial interface is idle. This guarantees that a burst read of sensor registers will read measurements from the same sampling instant. Note that if burst reads are not used, the user is responsible for ensuring a set of single byte reads correspond to a single sampling instant by checking the Data Ready interrupt.
*	Data is placed in these external sensor data registers according to I2C_SLV0_CTRL, I2C_SLV1_CTRL, I2C_SLV2_CTRL, and I2C_SLV3_CTRL (Registers 39, 42, 45, and 48). When more than zero bytes are read (I2C_SLVx_LEN > 0) from an enabled slave (I2C_SLVx_EN = 1), the slave is read at the Sample Rate (as defined in Register 25) or delayed rate (if specified in Register 52 and 103). During each Sample cycle, slave reads are performed in order of Slave number. If all slaves are enabled with more than zero bytes to be read, the order will be Slave 0, followed by Slave 1, Slave 2, and Slave 3.
*	Each enabled slave will have EXT_SENS_DATA registers associated with it by number of bytes read (I2C_SLVx_LEN) in order of slave number, starting from EXT_SENS_DATA_00. Note that this means enabling or disabling a slave may change the higher numbered slaves＊ associated registers. Furthermore, if fewer total bytes are being read from the external sensors as a result of such a change, then the data remaining in the registers which no longer have an associated slave device (i.e. high numbered registers) will remain in these previously allocated registers unless reset.
*	If the sum of the read lengths of all SLVx transactions exceed the number of available EXT_SENS_DATA registers , the excess bytes will be dropped. There are 24 EXT_SENS_DATA registers and hence the total read lengths between all the slaves cannot be greater than 24 or some bytes will be lost.
*Note: Slave 4＊s behavior is distinct from that of Slaves 0-3. For further information regarding the characteristics of Slave 4, please refer to Registers 49 to 53.
*Example:
*	Suppose that Slave 0 is enabled with 4 bytes to be read (I2C_SLV0_EN = 1 and I2C_SLV0_LEN = 4) while Slave 1 is enabled with 2 bytes to be read, (I2C_SLV1_EN=1 and I2C_SLV1_LEN = 2). In such a situation, EXT_SENS_DATA _00 through _03 will be associated with Slave 0, while EXT_SENS_DATA _04 and 05 will be associated with Slave 1.
*	If Slave 2 is enabled as well, registers starting from EXT_SENS_DATA_06 will be allocated to Slave 2.
*	If Slave 2 is disabled while Slave 3 is enabled in this same situation, then registers starting from EXT_SENS_DATA_06 will be allocated to Slave 3 instead.
*Register Allocation for Dynamic Disable vs. Normal Disable
*	If a slave is disabled at any time, the space initially allocated to the slave in the EXT_SENS_DATA register, will remain associated with that slave. This is to avoid dynamic adjustment of the register allocation.
*	The allocation of the EXT_SENS_DATA registers is recomputed only when (1) all slaves are disabled, or (2) the I2C_MST_RST bit is set (Register 106) .
*	This above is also true if one of the slaves gets NACKed and stops functioning.
************************************************************************************************/
#define MPU6050_RA_EXT_SENS_DATA_00			0x49
#define MPU6050_RA_EXT_SENS_DATA_01			0x4A
#define MPU6050_RA_EXT_SENS_DATA_02			0x4B
#define MPU6050_RA_EXT_SENS_DATA_03			0x4C
#define MPU6050_RA_EXT_SENS_DATA_04			0x4D
#define MPU6050_RA_EXT_SENS_DATA_05			0x4E
#define MPU6050_RA_EXT_SENS_DATA_06			0x4F
#define MPU6050_RA_EXT_SENS_DATA_07			0x50
#define MPU6050_RA_EXT_SENS_DATA_08			0x51
#define MPU6050_RA_EXT_SENS_DATA_09			0x52
#define MPU6050_RA_EXT_SENS_DATA_10			0x53
#define MPU6050_RA_EXT_SENS_DATA_11			0x54
#define MPU6050_RA_EXT_SENS_DATA_12			0x55
#define MPU6050_RA_EXT_SENS_DATA_13			0x56
#define MPU6050_RA_EXT_SENS_DATA_14			0x57
#define MPU6050_RA_EXT_SENS_DATA_15			0x58
#define MPU6050_RA_EXT_SENS_DATA_16			0x59
#define MPU6050_RA_EXT_SENS_DATA_17			0x5A
#define MPU6050_RA_EXT_SENS_DATA_18			0x5B
#define MPU6050_RA_EXT_SENS_DATA_19			0x5C
#define MPU6050_RA_EXT_SENS_DATA_20			0x5D
#define MPU6050_RA_EXT_SENS_DATA_21			0x5E
#define MPU6050_RA_EXT_SENS_DATA_22			0x5F
#define MPU6050_RA_EXT_SENS_DATA_23			0x60

#define MPU6050_RA_MOT_DETECT_STATUS		0x61
#define MPU6050_RA_I2C_SLV0_DO				0x63
#define MPU6050_RA_I2C_SLV1_DO				0x64
#define MPU6050_RA_I2C_SLV2_DO				0x65
#define MPU6050_RA_I2C_SLV3_DO				0x66
#define MPU6050_RA_I2C_MST_DELAY_CTRL		0x67
#define MPU6050_RA_SIGNAL_PATH_RESET		0x68
/************************************************************************************************
*Register 105 每 Motion Detection Control
*Type: Read/Write
*+--------------+------------------+------+------+---------+---------+------+------+------+-------+
*|Register (Hex)|Register (Decimal)| Bit7 | Bit6 |   Bit5  |   Bit4  | Bit3 | Bit2 | Bit1 |  Bit0 |
*+--------------+------------------+------+------+---------+---------+------+------+------+-------+
*|		1C	    |        28        |   -  |   -  |ACCEL_ON_DELAY[1:0]|FF_COUNT[1:0]|MOT_COUNT[1:0]|
*+--------------+------------------+------+------+-------------------+-------------+--------------+
*Description:
*	This register is used to add delay to the accelerometer power on time. It is also used to configure the Free Fall and Motion detection decrement rate.
*	The accelerometer data path provides samples to the sensor registers, Motion detection, Zero Motion detection, and Free Fall detection modules. The signal path contains filters which must be flushed on wake-up with new samples before the detection modules begin operations. The default wake-up delay, of 4ms can be lengthened by up to 3ms. This additional delay is specified in ACCEL_ON_DELAY in units of 1 LSB = 1 ms. The user may select any value above zero unless instructed otherwise by InvenSense. Please refer to Section 8 of the MPU-6000/MPU-6050 Product Specification document for further information regarding the detection modules.
*	Detection is registered by the Free Fall detection module or the Motion detection module after accelerometer measurements meet their respective threshold conditions over a specified number of samples. When the threshold conditions are met, the corresponding detection counter increments by 1. The user may control the rate at which the detection counter decrements when the threshold condition is not met by configuring FF_COUNT and MOT_COUNT. The decrement rate can be set according to the following table:
*	FF_COUNT or MOT_COUNT-----Counter Decrement
*			 0						Reset
*			 1						  1
*			 2						  2
*			 3						  4
*	When FF_COUNT or MOT_COUNT are configured to 0 (reset), any non-qualifying sample will reset the corresponding counter to 0. For further information on Free Fall detection and Motion detection, please refer to Registers 29 to 32.
*	Bits 7 and 6 are reserved.
*Parameters:
*	ACCEL_ON_DELAY	2-bit unsigned value. Specifies the additional power-on delay applied to accelerometer data path modules.
*					Unit of 1 LSB = 1 ms.
*	FF_COUNT		2-bit unsigned value. Configures the Free Fall detection counter decrement rate.
*	MOT_COUNT		2-bit unsigned value. Configures the Motion detection counter decrement rate.
************************************************************************************************/
#define MPU6050_RA_MOT_DETECT_CTRL			0x69
#define MPU6050_RA_USER_CTRL				0x6A
/************************************************************************************************
*Register 107(R6Bh) 每 Power Management 1
*Type: Read/Write
*+--------------+------------------+------------+------+------+------+--------+------+------+------+
*|Register (Hex)|Register (Decimal)|    Bit7    | Bit6 | Bit5 | Bit4 |  Bit3  | Bit2 | Bit1 | Bit0 |
*+--------------+------------------+------------+------+------+------+--------+------+------+------+
*|		6B	    |        107       |DEVICE_RESET| SLEEP| CYCLE|   -  |TEMP_DIS|     CLKSEL[2:0]    |
*+--------------+------------------+------------+------+------+------+--------+--------------------+
*Description:
*	This register allows the user to configure the power mode and clock source. It also provides a bit for resetting the entire device, and a bit for disabling the temperature sensor.
*	By setting SLEEP to 1, the MPU-60X0 can be put into low power sleep mode. When CYCLE is set to 1 while SLEEP is disabled, the MPU-60X0 will be put into Cycle Mode. In Cycle Mode, the device cycles between sleep mode and waking up to take a single sample of data from active sensors at a rate determined by LP_WAKE_CTRL (register 108). To configure the wake frequency, use LP_WAKE_CTRL within the Power Management 2 register (Register 108).
*	An internal 8MHz oscillator, gyroscope based clock, or external sources can be selected as the MPU-60X0 clock source. When the internal 8 MHz oscillator or an external source is chosen as the clock source, the MPU-60X0 can operate in low power modes with the gyroscopes disabled.
*	Upon power up, the MPU-60X0 clock source defaults to the internal oscillator. However, it is highly recommended that the device be configured to use one of the gyroscopes (or an external clock source) as the clock reference for improved stability. The clock source can be selected according to the following table.
*		CLKSEL--------------------Clock Source
*         0              Internal 8MHz oscillator
*         1				 PLL with X axis gyroscope reference
*         2              PLL with Y axis gyroscope reference
*         3              PLL with Z axis gyroscope reference
*         4              PLL with external 32.768kHz reference
*         5              PLL with external 19.2MHz reference
*         6              Reserved
*         7              Stops the clock and keeps the timing generator in reset
*	For further information regarding the MPU-60X0 clock source, please refer to the MPU-6000/MPU-6050 Product Specification document.
*	Bit 4 is reserved.
*Parameters:
*	DEVICE_RESET	When set to 1, this bit resets all internal registers to their default values.
*					The bit automatically clears to 0 once the reset is done.
*					The default values for each register can be found in Section 3.
*	SLEEP			When set to 1, this bit puts the MPU-60X0 into sleep mode.
*	CYCLE			When this bit is set to 1 and SLEEP is disabled, the MPU-60X0 will cycle between sleep mode and waking up to take a single sample of data from active sensors at a rate determined by LP_WAKE_CTRL (register 108).
*	TEMP_DIS		When set to 1, this bit disables the temperature sensor.
*	CLKSEL			3-bit unsigned value. Specifies the clock source of the device.
************************************************************************************************/
#define MPU6050_RA_PWR_MGMT_1				0x6B
/************************************************************************************************
*Register 108(R6Ch) 每 Power Management 2
*Type: Read/Write
*+--------------+------------------+--------+--------+-------+-------+-------+-------+-------+-------+
*|Register (Hex)|Register (Decimal)|  Bit7  |  Bit6  |  Bit5 |  Bit4 |  Bit3 |  Bit2 |  Bit1 |  Bit0 |
*+--------------+------------------+--------+--------+-------+-------+-------+-------+-------+-------+
*|		6C	    |        108       |LP_WAKE_CTRL[1:0]|STBY_XA|STBY_YA|STBY_ZA|STBY_XG|STBY_YG|STBY_ZG|
*+--------------+------------------+-----------------+-------+-------+-------+-------+-------+-------+
*Description:
*	This register allows the user to configure the frequency of wake-ups in Accelerometer Only Low Power Mode. This register also allows the user to put individual axes of the accelerometer and gyroscope into standby mode.
*	The MPU-9150 can be put into Accerlerometer Only Low Power Mode by setting PWRSEL to 1 in the Power Management 1 register (Register 107). In this mode, the device will power off all devices except for the primary I2C interface, waking only the accelerometer at fixed intervals to take a single measurement. The frequency of wake-ups can be configured with LP_WAKE_CTRL as shown below.
*	LP_WAKE_CTRL-----Wake-up Frequency
*		  0				   1.25 Hz
*		  1				    2.5 Hz
*		  2					  5 Hz
*		  3					 10 Hz 
*	For further information regarding the MPU-9150＊s power modes, please refer to Register 107.
*	The user can put individual accelerometer and gyroscopes axes into standby mode by using this register. If the device is using a gyroscope axis as the clock source and this axis is put into standby mode, the clock source will automatically be changed to the internal 8MHz oscillator.
*Parameters:
*	LP_WAKE_CTRL	2-bit unsigned value.
*					Specifies the frequency of wake-ups during Accelerometer Only Low Power Mode.
*	STBY_XA			When set to 1, this bit puts the X axis accelerometer into standby mode.
*	STBY_YA			When set to 1, this bit puts the Y axis accelerometer into standby mode.
*	STBY_ZA			When set to 1, this bit puts the Z axis accelerometer into standby mode.
*	STBY_XG			When set to 1, this bit puts the X axis gyroscope into standby mode.
*	STBY_YG			When set to 1, this bit puts the Y axis gyroscope into standby mode.
*	STBY_ZG			When set to 1, this bit puts the Z axis gyroscope into standby mode.
************************************************************************************************/
#define MPU6050_RA_PWR_MGMT_2				0x6C
#define MPU6050_RA_BANK_SEL					0x6D
#define MPU6050_RA_MEM_START_ADDR			0x6E
#define MPU6050_RA_MEM_R_W					0x6F
#define MPU6050_RA_DMP_CFG_1				0x70
#define MPU6050_RA_DMP_CFG_2				0x71
#define MPU6050_RA_FIFO_COUNTH				0x72
#define MPU6050_RA_FIFO_COUNTL				0x73
#define MPU6050_RA_FIFO_R_W					0x74
/************************************************************************************************
*Register 117(R75h) 每 Who Am I
*Type: Read Only
*+--------------+------------------+------+------+------+------+------+------+------+------+
*|Register (Hex)|Register (Decimal)| Bit7 | Bit6 | Bit5 | Bit4 | Bit3 | Bit2 | Bit1 | Bit0 |
*+--------------+------------------+------+------+------+------+------+------+------+------+
*|		75	    |        117       |   -  |              WHO_AM_I[6:1]              |   -  |
*+--------------+------------------+------+------+------+-------------+--------------------+
*Description:
*	This register is used to verify the identity of the device. The contents of WHO_AM_I are the upper 6 bits of the MPU-60X0＊s 7-bit I2C address. The least significant bit of the MPU-60X0＊s I2C address is determined by the value of the AD0 pin. The value of the AD0 pin is not reflected in this register.
*	The default value of the register is 0x68.
*	Bits 0 and 7 are reserved. (Hard coded to 0)
*Parameters:
*	WHO_AM_I	Contains the 6-bit I2C address of the MPU-60X0.
*				The Power-On-Reset value of Bit6:Bit1 is 110 100.
************************************************************************************************/
#define MPU6050_RA_WHO_AM_I					0x75

/******************************************************************************/
/**************************** END REGISTER MAPPING  ***************************/
/******************************************************************************/

#define MPU6050_RA_DATA_START_ADDR			0x3B

#define MPU6050_TC_PWR_MODE_BIT				7
#define MPU6050_TC_OFFSET_BIT				6
#define MPU6050_TC_OFFSET_LENGTH			6
#define MPU6050_TC_OTP_BNK_VLD_BIT			0

#define MPU6050_VDDIO_LEVEL_VLOGIC			0
#define MPU6050_VDDIO_LEVEL_VDD				1

