WSCKY/STM32F401RE_Nucleo_Demo/MyProj/Ext_MPU6050/inc/stm32f4xx_nucleo_ExtMPU6050.h
#define MPU6050_CFG_EXT_SYNC_SET_BIT		5
#define MPU6050_CFG_EXT_SYNC_SET_LENGTH		3
#define MPU6050_CFG_DLPF_CFG_BIT			2
#define MPU6050_CFG_DLPF_CFG_LENGTH			3
/*--------------------Configuration (CONFIG)--------------------*/
#define MPU6050_EXT_SYNC_DISABLED			(0x00<<3)
#define MPU6050_EXT_SYNC_TEMP_OUT_L			(0x01<<3)
#define MPU6050_EXT_SYNC_GYRO_XOUT_L		(0x02<<3)
#define MPU6050_EXT_SYNC_GYRO_YOUT_L		(0x03<<3)
#define MPU6050_EXT_SYNC_GYRO_ZOUT_L		(0x04<<3)
#define MPU6050_EXT_SYNC_ACCEL_XOUT_L		(0x05<<3)
#define MPU6050_EXT_SYNC_ACCEL_YOUT_L		(0x06<<3)
#define MPU6050_EXT_SYNC_ACCEL_ZOUT_L		(0x07<<3)
#define MPU6050_DLPF_BW_256					0x00
#define MPU6050_DLPF_BW_188					0x01
#define MPU6050_DLPF_BW_98					0x02
#define MPU6050_DLPF_BW_42					0x03
#define MPU6050_DLPF_BW_20					0x04
#define MPU6050_DLPF_BW_10					0x05
#define MPU6050_DLPF_BW_5					0x06

#define MPU6050_GCONFIG_FS_SEL_BIT			4
#define MPU6050_GCONFIG_FS_SEL_LENGTH		2
/*--------------------Gyroscope Configuration (GYRO_CONFIG)--------------------*/
#define MPU6050_GYRO_FS_250					(0x00<<3)
#define MPU6050_GYRO_FS_500					(0x01<<3)
#define MPU6050_GYRO_FS_1000				(0x02<<3)
#define MPU6050_GYRO_FS_2000				(0x03<<3)

#define MPU6050_ACONFIG_XA_ST_BIT			7
#define MPU6050_ACONFIG_YA_ST_BIT			6
#define MPU6050_ACONFIG_ZA_ST_BIT			5
#define MPU6050_ACONFIG_AFS_SEL_BIT			4
#define MPU6050_ACONFIG_AFS_SEL_LENGTH		2
#define MPU6050_ACONFIG_ACCEL_HPF_BIT		2
#define MPU6050_ACONFIG_ACCEL_HPF_LENGTH	3
/*--------------------Accelerometer Configuration (ACCEL_CONFIG)--------------------*/
#define MPU6050_ACCEL_FS_2					(0x00<<3)
#define MPU6050_ACCEL_FS_4					(0x01<<3)
#define MPU6050_ACCEL_FS_8					(0x02<<3)
#define MPU6050_ACCEL_FS_16					(0x03<<3)
#define MPU6050_DHPF_RESET					0x00
#define MPU6050_DHPF_5						0x01
#define MPU6050_DHPF_2P5					0x02
#define MPU6050_DHPF_1P25					0x03
#define MPU6050_DHPF_0P63					0x04
#define MPU6050_DHPF_HOLD					0x07

#define MPU6050_TEMP_FIFO_EN_BIT			7
#define MPU6050_XG_FIFO_EN_BIT				6
#define MPU6050_YG_FIFO_EN_BIT				5
#define MPU6050_ZG_FIFO_EN_BIT				4
#define MPU6050_ACCEL_FIFO_EN_BIT			3
#define MPU6050_SLV2_FIFO_EN_BIT			2
#define MPU6050_SLV1_FIFO_EN_BIT			1
#define MPU6050_SLV0_FIFO_EN_BIT			0

#define MPU6050_MULT_MST_EN_BIT				7
#define MPU6050_WAIT_FOR_ES_BIT				6
#define MPU6050_SLV_3_FIFO_EN_BIT			5
#define MPU6050_I2C_MST_P_NSR_BIT			4
#define MPU6050_I2C_MST_CLK_BIT				3
#define MPU6050_I2C_MST_CLK_LENGTH			4

#define MPU6050_CLOCK_DIV_348				0x0
#define MPU6050_CLOCK_DIV_333				0x1
#define MPU6050_CLOCK_DIV_320				0x2
#define MPU6050_CLOCK_DIV_308				0x3
#define MPU6050_CLOCK_DIV_296				0x4
#define MPU6050_CLOCK_DIV_286				0x5
#define MPU6050_CLOCK_DIV_276				0x6
#define MPU6050_CLOCK_DIV_267				0x7
#define MPU6050_CLOCK_DIV_258				0x8
#define MPU6050_CLOCK_DIV_500				0x9
#define MPU6050_CLOCK_DIV_471				0xA
#define MPU6050_CLOCK_DIV_444				0xB
#define MPU6050_CLOCK_DIV_421				0xC
#define MPU6050_CLOCK_DIV_400				0xD
#define MPU6050_CLOCK_DIV_381				0xE
#define MPU6050_CLOCK_DIV_364				0xF

#define MPU6050_I2C_SLV_RW_BIT				7
#define MPU6050_I2C_SLV_ADDR_BIT			6
#define MPU6050_I2C_SLV_ADDR_LENGTH			7
#define MPU6050_I2C_SLV_EN_BIT				7
#define MPU6050_I2C_SLV_BYTE_SW_BIT			6
#define MPU6050_I2C_SLV_REG_DIS_BIT			5
#define MPU6050_I2C_SLV_GRP_BIT				4
#define MPU6050_I2C_SLV_LEN_BIT				3
#define MPU6050_I2C_SLV_LEN_LENGTH			4

#define MPU6050_I2C_SLV4_RW_BIT				7
#define MPU6050_I2C_SLV4_ADDR_BIT			6
#define MPU6050_I2C_SLV4_ADDR_LENGTH		7
#define MPU6050_I2C_SLV4_EN_BIT				7
#define MPU6050_I2C_SLV4_INT_EN_BIT			6
#define MPU6050_I2C_SLV4_REG_DIS_BIT		5
#define MPU6050_I2C_SLV4_MST_DLY_BIT		4
#define MPU6050_I2C_SLV4_MST_DLY_LENGTH		5

#define MPU6050_MST_PASS_THROUGH_BIT		7
#define MPU6050_MST_I2C_SLV4_DONE_BIT		6
#define MPU6050_MST_I2C_LOST_ARB_BIT		5
#define MPU6050_MST_I2C_SLV4_NACK_BIT		4
#define MPU6050_MST_I2C_SLV3_NACK_BIT		3
#define MPU6050_MST_I2C_SLV2_NACK_BIT		2
#define MPU6050_MST_I2C_SLV1_NACK_BIT		1
#define MPU6050_MST_I2C_SLV0_NACK_BIT		0

#define MPU6050_INTCFG_INT_LEVEL_BIT		7
#define MPU6050_INTCFG_INT_OPEN_BIT			6
#define MPU6050_INTCFG_LATCH_INT_EN_BIT		5
#define MPU6050_INTCFG_INT_RD_CLEAR_BIT		4
#define MPU6050_INTCFG_FSYNC_INT_LEVEL_BIT	3
#define MPU6050_INTCFG_FSYNC_INT_EN_BIT		2
#define MPU6050_INTCFG_I2C_BYPASS_EN_BIT	1
#define MPU6050_INTCFG_CLKOUT_EN_BIT		0
/*--------------------INT Pin / Bypass Enable Configuration (INT_PIN_CFG)--------------------*/
#define MPU6050_INTMODE_ACTIVEHIGH			(0x00<<7)
#define MPU6050_INTMODE_ACTIVELOW			(0x01<<7)
#define MPU6050_INTDRV_PUSHPULL				(0x00<<6)
#define MPU6050_INTDRV_OPENDRAIN			(0x01<<6)
#define MPU6050_INTLATCH_50USPULSE			(0x00<<5)
#define MPU6050_INTLATCH_WAITCLEAR			(0x01<<5)
#define MPU6050_INTCLEAR_STATUSREAD			(0x00<<4)
#define MPU6050_INTCLEAR_ANYREAD			(0x01<<4)

/*--------------------Interrupt Enable (INT_ENABLE)--------------------*/
#define MPU6050_INTERRUPT_DATA_RDY_ENABLE	0x01
#define MPU6050_INTERRUPT_DATA_RDY_DISABLE	0x00

#define MPU6050_INTERRUPT_FF_BIT			7
#define MPU6050_INTERRUPT_MOT_BIT			6
#define MPU6050_INTERRUPT_ZMOT_BIT			5
#define MPU6050_INTERRUPT_FIFO_OFLOW_BIT	4
#define MPU6050_INTERRUPT_I2C_MST_INT_BIT	3
#define MPU6050_INTERRUPT_PLL_RDY_INT_BIT	2
#define MPU6050_INTERRUPT_DMP_INT_BIT		1
#define MPU6050_INTERRUPT_DATA_RDY_BIT		0

// TODO: figure out what these actually do
// UMPL source code is not very obivous
#define MPU6050_DMPINT_5_BIT				5
#define MPU6050_DMPINT_4_BIT				4
#define MPU6050_DMPINT_3_BIT				3
#define MPU6050_DMPINT_2_BIT				2
#define MPU6050_DMPINT_1_BIT				1
#define MPU6050_DMPINT_0_BIT				0

#define MPU6050_MOTION_MOT_XNEG_BIT			7
#define MPU6050_MOTION_MOT_XPOS_BIT			6
#define MPU6050_MOTION_MOT_YNEG_BIT			5
#define MPU6050_MOTION_MOT_YPOS_BIT			4
#define MPU6050_MOTION_MOT_ZNEG_BIT			3
#define MPU6050_MOTION_MOT_ZPOS_BIT			2
#define MPU6050_MOTION_MOT_ZRMOT_BIT		0

