WSCKY/STM32F401RE_Nucleo_Demo/MyProj/Ext_MPU6050/inc/stm32f4xx_nucleo_ExtMPU6050.h
#define MPU6050_DELAYCTRL_DELAY_ES_SHADOW_BIT	7
#define MPU6050_DELAYCTRL_I2C_SLV4_DLY_EN_BIT	4
#define MPU6050_DELAYCTRL_I2C_SLV3_DLY_EN_BIT	3
#define MPU6050_DELAYCTRL_I2C_SLV2_DLY_EN_BIT	2
#define MPU6050_DELAYCTRL_I2C_SLV1_DLY_EN_BIT	1
#define MPU6050_DELAYCTRL_I2C_SLV0_DLY_EN_BIT	0

#define MPU6050_PATHRESET_GYRO_RESET_BIT	2
#define MPU6050_PATHRESET_ACCEL_RESET_BIT	1
#define MPU6050_PATHRESET_TEMP_RESET_BIT	0

#define MPU6050_DETECT_ACCEL_ON_DELAY_BIT		5
#define MPU6050_DETECT_ACCEL_ON_DELAY_LENGTH	2
#define MPU6050_DETECT_FF_COUNT_BIT				3
#define MPU6050_DETECT_FF_COUNT_LENGTH			2
#define MPU6050_DETECT_MOT_COUNT_BIT			1
#define MPU6050_DETECT_MOT_COUNT_LENGTH			2
/*--------------------Motion Detection Control (MOT_DETECT_CTRL)--------------------*/
#define MPU6050_DETECT_FF_COUNT_RESET		(0x00<<2)
#define MPU6050_DETECT_FF_COUNT_1			(0x01<<2)
#define MPU6050_DETECT_FF_COUNT_2			(0x02<<2)
#define MPU6050_DETECT_FF_COUNT_4			(0x03<<2)
#define MPU6050_DETECT_MOT_COUNT_RESET		0x00
#define MPU6050_DETECT_MOT_COUNT_1			0x01
#define MPU6050_DETECT_MOT_COUNT_2			0x02
#define MPU6050_DETECT_MOT_COUNT_4			0x03

#define MPU6050_USERCTRL_DMP_EN_BIT			7
#define MPU6050_USERCTRL_FIFO_EN_BIT		6
#define MPU6050_USERCTRL_I2C_MST_EN_BIT		5
#define MPU6050_USERCTRL_I2C_IF_DIS_BIT		4
#define MPU6050_USERCTRL_DMP_RESET_BIT		3
#define MPU6050_USERCTRL_FIFO_RESET_BIT		2
#define MPU6050_USERCTRL_I2C_MST_RESET_BIT	1
#define MPU6050_USERCTRL_SIG_COND_RESET_BIT	0

#define MPU6050_PWR1_DEVICE_RESET_BIT		7
#define MPU6050_PWR1_SLEEP_BIT				6
#define MPU6050_PWR1_CYCLE_BIT				5
#define MPU6050_PWR1_TEMP_DIS_BIT			3
#define MPU6050_PWR1_CLKSEL_BIT				2
#define MPU6050_PWR1_CLKSEL_LENGTH			3
/*--------------------Power Management 1 (PWR_MGMT_1)--------------------*/
#define MPU6050_PWR1_DEVICE_RESET			(0x01<<7)
#define MPU6050_PWR1_DEVICE_SET				(0x00<<7)
#define MPU6050_PWR1_SLEEP_ENABLE			(0x01<<6)
#define MPU6050_PWR1_SLEEP_DISABLE			(0x00<<6)
#define MPU6050_CLOCK_INTERNAL				0x00
#define MPU6050_CLOCK_PLL_XGYRO				0x01
#define MPU6050_CLOCK_PLL_YGYRO				0x02
#define MPU6050_CLOCK_PLL_ZGYRO				0x03
#define MPU6050_CLOCK_PLL_EXT32K			0x04
#define MPU6050_CLOCK_PLL_EXT19M			0x05
#define MPU6050_CLOCK_KEEP_RESET			0x07
/*--------------------Power Management 2 (PWR_MGMT_2)--------------------*/
#define MPU6050_PWR2_LP_WAKE_CTRL_BIT		7
#define MPU6050_PWR2_LP_WAKE_CTRL_LENGTH	2
#define MPU6050_PWR2_STBY_XA				(0x01<<5)
#define MPU6050_PWR2_STBY_YA				(0x01<<4)
#define MPU6050_PWR2_STBY_ZA				(0x01<<3)
#define MPU6050_PWR2_STBY_XG				(0x01<<2)
#define MPU6050_PWR2_STBY_YG				(0x01<<1)
#define MPU6050_PWR2_STBY_ZG				0x01
#define MPU6050_PWR2_STBY_None				0x00
#define MPU6050_WAKE_FREQ_1P25				(0x00<<6)
#define MPU6050_WAKE_FREQ_2P5				(0x01<<6)
#define MPU6050_WAKE_FREQ_5					(0x02<<6)
#define MPU6050_WAKE_FREQ_10				(0x03<<6)

#define MPU6050_BANKSEL_PRFTCH_EN_BIT		6
#define MPU6050_BANKSEL_CFG_USER_BANK_BIT	5
#define MPU6050_BANKSEL_MEM_SEL_BIT			4
#define MPU6050_BANKSEL_MEM_SEL_LENGTH		5

#define MPU6050_WHO_AM_I_BIT				6
#define MPU6050_WHO_AM_I_LENGTH				6

void MPU6050_Init(MPU6050_InitTypeDef *MPU6050_InitStruct);
void MPU6050_INT_Init(MPU6050_INTTypeDef *MPU6050_INTStruct);
void MPU6050_Reset(FlagStatus Status);
uint8_t MPU6050_GetID(void);
int16_t MPU6050_GetAcceX(void);
int16_t MPU6050_GetAcceY(void);
int16_t MPU6050_GetAcceZ(void);
int16_t MPU6050_GetGyroX(void);
int16_t MPU6050_GetGyroY(void);
int16_t MPU6050_GetGyroZ(void);
void MPU6050_Correct(AcceDef *AcceOffset, GyroDef *GyroOffset);
bool I2C_WriteDeviceRegister(uint8_t DeviceAddr, uint8_t RegisterAddr, uint8_t RegisterValue);
uint8_t I2C_ReadDeviceRegister(uint8_t DeviceAddr, uint8_t RegisterAddr);
int16_t I2C_ReadDataBuffer(uint8_t DeviceAddr, uint32_t RegisterAddr);

#endif /* __STM32F4XX_NUCLEO_EXTMPU6050_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
